/* G E N E R A L */

/* OK button */
"OK" = "OK";

/* cancel button */
"Cancel" = "Cancel";

/* delete button */
"Delete" = "Delete";

/* error */
"Error" = "Error";

/* warning */
"Warning" = "Warning";


/* M A I N  C O N T R O L L E R */

/* message of panel when name/host/socket are missing */
"Please enter at least name and host or socket!" = "Please enter at least name and host or socket!";

/* message of panel when favorite name has already been used */
"Favorite %@ has already been saved!\nPlease specify another name." = "Favorite %@ has already been saved!\nPlease specify another name.";

/* message of panel when check for current version number failed */
"Error while trying to get the current version number!\nBe sure that you are connected to the internet and try again later." = "Error while trying to get the current version number!\nBe sure that you are connected to the internet and try again later.";

/* title of panel when update is available */
"Update available" = "Update available";

/* message of panel when update is available */
"There is a newer version available (version %@)!\nClick OK to open the download site." = "There is a newer version available (version %@)!\nClick OK to open the download site.";

/* title of panel when no update is available */
"No update available" = "No update available";

/* message of panel when no update is available */
"There is no newer version available!" = "There is no newer version available!";

/* message of panel when passwords have to be updated for v0.4 */
"With version 0.1 Shift has introduced a new format to save passwords in the Keychain.\nPlease allow Shift to decrypt all passwords of your favorites. Otherwise you have to reenter all passwords of your saved favorites in the Preferences." = "With version 0.1 Shift has introduced a new format to save passwords in the Keychain.\nPlease allow Shift to decrypt all passwords of your favorites. Otherwise you have to reenter all passwords of your saved favorites in the Preferences.";

/* title of donation panel */
"Donation" = "Donation";

/* message of donation panel */
"Shift lives from donations. Thank you for donating!" = "Shift lives from donations. Thank you for donating!";

/* donate button */
"Donate" = "Donate";

/* later button */
"Later" = "Later";

/* T A B L E  D O C U M E N T */

/* connection failed */
"Connection failed!" = "Connection failed!";

/* message of panel when connection to host failed */
"Unable to connect to host %@.\nBe sure that the address is correct and that you have the necessary privileges.\nMySQL said: %@" = "Unable to connect to host %@.\nBe sure that the address is correct and that you have the necessary privileges.\nMySQL said: %@";

/* message of panel when connection to db failed */
"Unable to connect to database %@.\nBe sure that the database exists and that you have the necessary privileges.\nMySQL said: %@" = "Unable to connect to database %@.\nBe sure that the database exists and that you have the necessary privileges.\nMySQL said: %@";

/* message of panel when host/socket are missing */
"Please enter at least a host or socket." = "Please enter at least a host or socket.";

/* menu item for custom connection */
"Custom" = "Custom";

/* menu item for saving connection to favorites */
"Save to favorites..." = "Save to favorites...";

/* message of panel when favorite name has already been used */
"Favorite %@ has already been saved!\nOpen Preferences to change the names of the favorites." = "Favorite %@ has already been saved!\nOpen Preferences to change the names of the favorites.";

/* message of panel when removing db failed */
"Couldn't remove database.\nMySQL said: %@" = "Couldn't remove database.\nMySQL said: %@";

/* menu item for choose db */
"Choose database..." = "Choose database...";

/* message of panel when connection to db failed after selecting from popupbutton */
"Unable to connect to database %@.\nBe sure that you have the necessary privileges." = "Unable to connect to database %@.\nBe sure that you have the necessary privileges.";

/* message of panel when no db name is given */
"Database must have a name." = "Database must have a name.";

/* message of panel when creation of db failed */
"Couldn't create database.\nMySQL said: %@" = "Couldn't create database.\nMySQL said: %@";

/* message of panel asking for confirmation for deleting db */
"Do you really want to delete the database %@?" = "Do you really want to delete the database %@?";

/* title of panel when successfully flushed privs */
"Flushed Privileges" = "Flushed Privileges";

/* message of panel when successfully flushed privs */
"Succesfully flushed privileges." = "Succesfully flushed privileges.";

/* message of panel when flushing privs failed */
"Couldn't flush privileges.\nMySQL said: %@" = "Couldn't flush privileges.\nMySQL said: %@";

/* title of panel when successfully performed table operation */
"Successfully performed table operation" = "Successfully performed table operation";

/* message of panel when successfully performed table operation */
"Operation: %@\nMsg_type: %@\nMsg_text: %@" = "Operation: %@\nMsg_type: %@\nMsg_text: %@";

/* message of panel when table operation failed */
"Couldn't perform table operation.\nMySQL said: %@" = "Couldn't perform table operation.\nMySQL said: %@";

/* toolbar item for show/hide console */
"Show/Hide Console" = "Show/Hide Console";

/* toolbar item for console */
"Console" = "Console";

/* tooltip for toolbar item for show/hide console */
"Show or hide the console which shows all MySQL commands performed by Shift" = "Show or hide the console which shows all MySQL commands performed by Shift";

/* toolbar item for clear console */
"Clear Console" = "Clear Console";

/* tooltip for toolbar item for clear console */
"Clear the console which shows all MySQL commands performed by Shift" = "Clear the console which shows all MySQL commands performed by Shift";

/* toolbar item for flush privileges */
"Flush Privileges" = "Flush Privileges";

/* tooltip for toolbar item for flush privileges */
"Reload the MySQL privileges saved in the mysql database" = "Reload the MySQL privileges saved in the mysql database";

/* toolbar item for perform table operation */
"Table Operations" = "Table Operations";

/* tooltip for toolbar item for perform table operations */
"Perform table operations for the selected table" = "Perform table operations for the selected table";

/* toolbar item for show variables */
"Show Variables" = "Show Variables";

/* tooltip for toolbar item for show variables */
"Show the MySQL Variables" = "Show the MySQL Variables";

/* toolbar item for create table syntax */
"Create Table Syntax" = "Create Table Syntax";

/* tooltip for toolbar item for create table syntax */
"Show the MySQL command used to create the selected table" = "Show the MySQL command used to create the selected table";


/* T A B L E S  L I S T */

/* message of panel asking for confirmation for deleting table */
"Do you really want to delete the table %@?" = "Do you really want to delete the table %@?";

/* message of panel asking for confirmation for deleting tables */
"Do you really want to delete the selected tables?" = "Do you really want to delete the selected tables?";

/* message of panel when no name is given for table */
"Table must have a name." = "Table must have a name.";

/* message of panel when table information cannot be retrieved */
"Couldn't get table information.\nMySQL said: %@" = "Couldn't get table information.\nMySQL said: %@";

/* message of panel when table cannot be created */
"Couldn't create table.\nMySQL said: %@" = "Couldn't create table.\nMySQL said: %@";

/* message of panel when table cannot be created with the given name */
"Couldn't add table %@.\nMySQL said: %@" = "Couldn't add table %@.\nMySQL said: %@";

/* message of panel when table content cannot be copied */
"There have been errors while copying table content. Please control the new table." = "There have been errors while copying table content. Please control the new table.";

/* message of panel when table cannot be removed */
"Couldn't remove table.\nMySQL said: %@" = "Couldn't remove table.\nMySQL said: %@";

/* message of panel when table cannot be renamed */
"Couldn't rename table.\nMySQL said: %@" = "Couldn't rename table.\nMySQL said: %@";


/* T A B L E  S O U R C E */

/* message of panel asking for confirmation for deleting field */
"Do you really want to delete the field %@?" = "Do you really want to delete the field %@?";

/* message of panel asking for confirmation for deleting index */
"Do you really want to delete the index %@?" = "Do you really want to delete the index %@?";

/* message of panel when index cannot be created */
"Couldn't add index.\nMySQL said: %@" = "Couldn't add index.\nMySQL said: %@";

/* message of panel when no columns are specified to be indexed */
"Please insert the columns you want to index." = "Please insert the columns you want to index.";

/* message of panel when field cannot be added */
"Couldn't add field %@.\nMySQL said: %@" = "Couldn't add field %@.\nMySQL said: %@";

/* message of panel when field cannot be added in drag&drop operation */
"Couldn't add field. MySQL said: %@" = "Couldn't add field. MySQL said: %@";

/* message of panel when field cannot be changed */
"Couldn't change field %@.\nMySQL said: %@" = "Couldn't change field %@.\nMySQL said: %@";

/* message of panel when field cannot be renamed in drag&drop operation */
"Couldn't rename field. MySQL said: %@" = "Couldn't rename field. MySQL said: %@";

/* message of panel when field cannot be removed */
"Couldn't remove field %@.\nMySQL said: %@" = "Couldn't remove field %@.\nMySQL said: %@";

/* message of panel when old field cannot be removed in drag&drop operation */
"Couldn't remove field. MySQL said: %@" = "Couldn't remove field. MySQL said: %@";

/* message of panel when index cannot be removed */
"Couldn't remove index.\nMySQL said: %@" = "Couldn't remove index.\nMySQL said: %@";

/* message of panel when trying to move indexed field */
"Indexed fields cannot be moved!" = "Indexed fields cannot be moved!";

/* message of panel when field content cannot be copied in drag&drop operation */
"Couldn't copy field values. MySQL said: %@" = "Couldn't copy field values. MySQL said: %@";

/* message of panel when table type cannot be removed */
"Couldn't change table type.\nMySQL said: %@" = "Couldn't change table type.\nMySQL said: %@";


/* T A B L E  C O N T E N T */

/* text showing the number of rows the result is limited to */
"Limited to %d rows starting with row" = "Limited to %d rows starting with row";

/* text showing that the result isn't limited */
"No limit" = "No limit";

/* text showing how many rows are in the result */
"%d rows in table" = "%d rows in table";

/* text showing how many rows are in the filtered result */
"%d rows of %d selected" = "%d rows of %d selected";


/* message of panel when trying to copy multiple rows */
"You can only copy single rows." = "You can only copy single rows.";

/* message of panel asking for confirmation for deleting all rows */
"Do you really want to delete all rows?" = "Do you really want to delete all rows?";

/* message of panel asking for confirmation for deleting the selected rows */
"Do you really want to delete the selected %d rows?" = "Do you really want to delete the selected %d rows?";

/* message of panel asking for confirmation for deleting the selected row */
"Do you really want to delete the selected row?" = "Do you really want to delete the selected row?";

/* popup menuitem for field (showing only if disabled) */
"field" = "field";

/* popup menuitem for field IS value */
"is" = "is";

/* popup menuitem for field IS NOT value */
"is not" = "is not";

/* popup menuitem for field CONTAINS value */
"contains" = "contains";

/* popup menuitem for field CONTAINS NOT value */
"contains not" = "contains not";

/* popup menuitem for field OLDER THAN value */
"older than" = "older than";

/* popup menuitem for field YOUNGER THAN value */
"younger than" = "younger than";

/* popup menuitem for field OLDER THAN OR EQUAL TO value */
"older than or equal to" = "older than or equal to";

/* popup menuitem for field YOUNGER THAN OR EQUAL TO value */
"younger than or equal to" = "younger than or equal to";

/* value shown for hidden blob and text fields */
"- blob or text -" = "- blob or text -";

/* message of panel when no rows have been affected after writing to the db */
"The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)" = "The row was not written to the MySQL database. You probably haven't changed anything.\nReload the table to be sure that the row exists and use a primary key for your table.\n(This error can be turned off in the preferences.)";

/* warning shown in the console when no rows have been affected after writing to the db */
"/* WARNING %@ No rows have been affected */\n" = "/* WARNING %@ No rows have been affected */\n";

/* message of panel when error while adding row to db */
"Couldn't write row.\nMySQL said: %@" = "Couldn't write row.\nMySQL said: %@";

/* message of panel when trying to edit tables without index and with hidden blob/text fields */
"You can't hide blob and text fields when working with tables without index." = "You can't hide blob and text fields when working with tables without index.";

/* message of panel when field cannot be removed */
"Couldn't remove rows.\nMySQL said: %@" = "Couldn't remove rows.\nMySQL said: %@";

/* message of panel when not all selected fields have been deleted */
"%d rows have not been removed. Reload the table to be sure that the rows exist and use a primary key for your table." = "%d rows have not been removed. Reload the table to be sure that the rows exist and use a primary key for your table.";

/* message of panel when sorting of table failed */
"Couldn't sort table. MySQL said: %@" = "Couldn't sort table. MySQL said: %@";

/* message of panel when loading of row failed */
"Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table." = "Couldn't load the row. Reload the table to be sure that the row exists and use a primary key for your table.";


/* C U S T O M  Q U E R Y */

/* error text when multiple custom query failed */
"[ERROR in query %d] %@\n" = "[ERROR in query %d] %@\n";

/* text shown when query was successfull */
"There were no errors." = "There were no errors.";

/* text showing how many rows have been affected */
"%@ row(s) affected" = "%@ row(s) affected";

/* message of panel when trying to save query which already exists in favorites */
"Query already exists in favorites." = "Query already exists in favorites.";

/* message of panel when trying to save empty query */
"Query can't be empty." = "Query can't be empty.";


/* T A B L E  D U M P */

/* message of panel when file cannot be replaced */
"Couldn't replace the file. Be sure that you have the necessary privileges." = "Couldn't replace the file. Be sure that you have the necessary privileges.";

/* message of panel when file cannot be written */
"Couldn't write to file. Be sure that you have the necessary privileges." = "Couldn't write to file. Be sure that you have the necessary privileges.";

/* message of panel when file cannot be opened */
"Couldn't open file. Be sure that the path is correct and that you have the necessary privileges." = "Couldn't open file. Be sure that the path is correct and that you have the necessary privileges.";

/* text showing that app is reading dump */
"Reading..." = "Reading...";

/* error text when reading of csv file gave errors */
"[ERROR in line %d] %@\n" = "[ERROR in line %d] %@\n";

/* text showing that app is writing dump */
"Dumping..." = "Dumping...";

/* text showing that app is dumping table */
"Dumping table %@..." = "Dumping table %@...";

/* text showing that app is writing text file */
"Writing..." = "Writing...";

/* text showing that app is writing table to text file */
"Writing table %@..." = "Writing table %@...";

/* text for csv import drop downs */
"Do not import" = "Do not import";
